Функция СведенияОВнешнейОбработке() Экспорт
    
    ИмяОтчета = ЭтотОбъект.Метаданные().Имя; 
    Синоним = ЭтотОбъект.Метаданные().Синоним; 
    Синоним = ?(ЗначениеЗаполнено(Синоним),Синоним, ИмяОтчета);         
    РегистрационныеДанные = Новый Структура;
    РегистрационныеДанные.Вставить("Вид","ДополнительныйОтчет"); //может быть – ПечатнаяФорма, ЗаполнениеОбъекта (для вн.обработки), ДополнительныйОтчет, СозданиеСвязанныхОбъектов… 
    РегистрационныеДанные.Вставить("Наименование", Синоним); //имя под которым обработка будет зарегестрирована в справочнике внешних обработок
    РегистрационныеДанные.Вставить("Версия", "20260116");
    РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
    РегистрационныеДанные.Вставить("Информация", "Отчет "+Синоним); //так будет выглядеть описание вн.отчета для пользователя
    
    ТаблицаКоманд = ПолучитьТаблицуКоманд();
    
    // Добавим команду в таблицу
    ДобавитьКоманду(ТаблицаКоманд, Синоним, "СформироватьОтчет" , "ОткрытиеФормы", Истина, );
        
    // Сохраним таблицу команд в параметры регистрации обработки
    РегистрационныеДанные.Вставить("Команды", ТаблицаКоманд);
    
    Возврат РегистрационныеДанные;
                                       
КонецФункции

Функция ПолучитьТаблицуКоманд()
    
    // Создадим пустую таблицу команд и колонки в ней
    Команды = Новый ТаблицаЗначений;

    // Как будет выглядеть описание печатной формы для пользователя
    Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 

    // Имя нашего макета, что бы могли отличить вызванную команду в обработке печати
    Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));

    // Тут задается, как должна вызваться команда обработки
    // Возможные варианты:
    // - ОткрытиеФормы - в этом случае в колонке идентификатор должно быть указано имя формы, которое должна будет открыть система
    // - ВызовКлиентскогоМетода - вызвать клиентскую экспортную процедуру из модуля формы обработки
    // - ВызовСерверногоМетода - вызвать серверную экспортную процедуру из модуля объекта обработки
    Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));

    // Следующий параметр указывает, необходимо ли показывать оповещение при начале и завершению работы обработки. Не имеет смысла при открытии формы
    Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));

    // Для печатной формы должен содержать строку ПечатьMXL 
    Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
    Возврат Команды;
   
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование = "ОткрытиеФормы", ПоказыватьОповещение = Ложь, Модификатор = "ПечатьMXL")
    
    // Добавляем команду в таблицу команд по переданному описанию.
    // Параметры и их значения можно посмотреть в функции ПолучитьТаблицуКоманд
    НоваяКоманда = ТаблицаКоманд.Добавить();
    НоваяКоманда.Представление = Представление;
    НоваяКоманда.Идентификатор = Идентификатор;
    НоваяКоманда.Использование = Использование;
    НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
    НоваяКоманда.Модификатор = Модификатор;

КонецПроцедуры    
  
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	УстановитьПривилегированныйРежим(Истина);
	
	СтандартнаяОбработка = Ложь;
	НастройкиМодифицированы = Ложь;
	
	УстановитьОбязательныеНастройки(НастройкиМодифицированы);
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ВнешниеНаборыДанных = Новый Структура;
	
	ВнешниеНаборыДанных.Вставить("ТаблицаДанных",ПолучитьТаблицуДанных()); 

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	

КонецПроцедуры

Процедура УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы)
	//КомпоновкаДанныхСервер.УстановитьПараметрыВалютыОтчета(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы);
	//КомпоновкаДанныхСервер.НастроитьДинамическийПериод(СхемаКомпоновкиДанных, КомпоновщикНастроек, Истина);
	//
	//ПараметрПоказыватьПродажи = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПоказыватьПродажи");
	//Если ПараметрПоказыватьПродажи <> Неопределено 
	//	И ПараметрПоказыватьПродажи.Значение = Неопределено Тогда
	//	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ПоказыватьПродажи", 1);
	//			
	//	ПользовательскиеНастройкиМодифицированы = Истина;
	//КонецЕсли;
	//
	//СегментыСервер.ВключитьОтборПоСегментуПартнеровВСКД(КомпоновщикНастроек);
	//СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(КомпоновщикНастроек);
	
	// Строковые литералы
	//КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаПродажиПоЗаказам", НСтр("ru='Продажи по заказам'"));
	//КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаПродажиБезЗаказов", НСтр("ru='Продажи без заказов'"));
КонецПроцедуры    

 // <Описание функции>
 //
 // Параметры:
 // Возвращаемое значение:
 //   <Тип.Вид>   - <описание возвращаемого значения>
 //
 Функция ПолучитьТаблицуДанных()
	 
	 Запрос  = Новый Запрос;
	 Запрос.Текст = ПолучитьТекстЗапроса();  
	 ПараметрПериод = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета"); 
	 
	 ПериодОтчета= КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрПериод.ИдентификаторПользовательскойНастройки);
	 ДатаНачала =  ПериодОтчета.Значение.ДатаНачала; 
	 ДатаОкончания =  ПериодОтчета.Значение.ДатаОкончания;
	 
	 Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);  
	 Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);    
	 Запрос.УстановитьПараметр("СтатусОплатыПоУмолчанию",Перечисления.СтатусОплатыСчета.НеОплачен);
	 
	 ТаблицаДанных = Новый ТаблицаЗначений;     
	 ТаблицаДанных.Колонки.Добавить("Invoice");
	 ТаблицаДанных.Колонки.Добавить("InvoiceNumber");
	 ТаблицаДанных.Колонки.Добавить("InvoiceDate"); 
	 ТаблицаДанных.Колонки.Добавить("Counterparty");  
	 ТаблицаДанных.Колонки.Добавить("Organization"); 
	 ТаблицаДанных.Колонки.Добавить("Vessel");  //подразделения организации
	 ТаблицаДанных.Колонки.Добавить("Currency");     
	 ТаблицаДанных.Колонки.Добавить("Comment");     
	 ТаблицаДанных.Колонки.Добавить("Voyage");  //Рейс   
	 ТаблицаДанных.Колонки.Добавить("InvoiceAmount");  
	 ТаблицаДанных.Колонки.Добавить("InvoiceAmountInUSD"); 
	 ТаблицаДанных.Колонки.Добавить("DueDate"); //срок оплаты документа, данные берутся из РС сроки оплаты документов 
	 ТаблицаДанных.Колонки.Добавить("Overdue");  //разность дат между датой окончания периода отчета и срока оплаты документа, если срок оплаты не заполнен тогда срок оплаты - дата окончания периода отчета
	 ТаблицаДанных.Колонки.Добавить("TermsOfPayment");  //значение из спр Условия оплаты, указанного в договоре
	 ТаблицаДанных.Колонки.Добавить("PaidAmount");  //сумма оплаты
	 ТаблицаДанных.Колонки.Добавить("PaidAmountInUSD");  
	 ТаблицаДанных.Колонки.Добавить("OutstandingAmountInUSD");  
	 ТаблицаДанных.Колонки.Добавить("NotDue"); 
	 ТаблицаДанных.Колонки.Добавить("СуммаПросрочкиДо7");
	 ТаблицаДанных.Колонки.Добавить("СуммаПросрочкиДо14");
	 ТаблицаДанных.Колонки.Добавить("СуммаПросрочкиДо21");
	 ТаблицаДанных.Колонки.Добавить("СуммаПросрочкиДо28");
	 ТаблицаДанных.Колонки.Добавить("СуммаПросрочкиДо45");
	 ТаблицаДанных.Колонки.Добавить("СуммаПросрочкиБольше45");
	 ТаблицаДанных.Колонки.Добавить("PaymentDate"); //дата последнего платежа
	 ТаблицаДанных.Колонки.Добавить("Статус");   
	 ТаблицаДанных.Колонки.Добавить("ServiceType"); //реквизит документа ТипСервиса 
	 ТаблицаДанных.Колонки.Добавить("Service");     //группа реквизита документа ТипСервиса 
	 ТаблицаДанных.Колонки.Добавить("LoadingPort");   
	 ТаблицаДанных.Колонки.Добавить("UnloadingPort");   
	 ТаблицаДанных.Колонки.Добавить("Payee");  //получатель платежа
	 ТаблицаДанных.Колонки.Добавить("SendDate");  //дата отправки инвойса клиенту 
	 ТаблицаДанных.Колонки.Добавить("PaymentCurrency");
	 ТаблицаДанных.Колонки.Добавить("OverdueAmount");  //сумма всей просроченной задолженности
	 ТаблицаДанных.Колонки.Добавить("AVG");  //средневзвешанный эйджинг     
	 ТаблицаДанных.Колонки.Добавить("ExRate");  //PaidAmount/  PaidAmountInUSD    -!!! добавить 
	 ТаблицаДанных.Колонки.Добавить("ServicePeriod");//период услуги
	 ТаблицаДанных.Колонки.Добавить("ContractNumber");//номер договора
	 ТаблицаДанных.Колонки.Добавить("AdditionalComment");//дополнительный комментарий
	 ТаблицаДанных.Колонки.Добавить("PaymentDateToThirdParty");
	 
	 ТД = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Invoice");
	 ТаблицаОплат =  ПолучитьТаблицуОплат(ТД,ДатаНачала,ДатаОкончания);
	 ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		 Если Выборка.Статус  <> Перечисления.СтатусОплатыСчета.Отменен Тогда
			 Overdue = Выборка.Overdue;  
			 СтрокаДанных = ТаблицаДанных.Добавить();
			 ЗаполнитьЗначенияСвойств(СтрокаДанных,Выборка); 
			 Если Выборка.Currency = ВалютаРегламентированногоУчета Тогда
				 СтрокаДанных.InvoiceAmountInUSD = СтрокаДанных.InvoiceAmount;
			 Иначе
				 СтрокаДанных.InvoiceAmountInUSD = РаботаСКурсамиВалют.ПересчитатьВВалюту(СтрокаДанных.InvoiceAmount, Выборка.Currency, ВалютаРегламентированногоУчета,ДатаОкончания) ;
			 КонецЕсли;  
			 
			 OutstandingAmountInUSD =СтрокаДанных.InvoiceAmountInUSD;
			 Оплаты = ТаблицаОплат.Скопировать(Новый Структура("Счет",Выборка.Invoice));
			 
			 Если Оплаты.Количество() Тогда 
				 СтрокаДанных.PaidAmount = Оплаты.Итог("СуммаПлатежа");
				 СтрокаДанных.PaidAmountInUSD = Оплаты.Итог("СуммаВзаиморасчетов");  
				 OutstandingAmountInUSD =  СтрокаДанных.InvoiceAmountInUSD - СтрокаДанных.PaidAmountInUSD;
				 СтрокаДанных.PaymentDate = Оплаты[Оплаты.Количество() -1].Дата; 
				 СтрокаДанных.PaymentCurrency= Оплаты[Оплаты.Количество() -1].ВалютаОплаты;
			 КонецЕсли;  
			 Если СтрокаДанных.PaidAmount=Неопределено ИЛИ СтрокаДанных.PaidAmountInUSD=Неопределено Тогда
				   СтрокаДанных.ExRate =0;
			 Иначе СтрокаДанных.ExRate = СтрокаДанных.PaidAmount/СтрокаДанных.PaidAmountInUSD;
			 КонецЕсли;
			 СтрокаДанных.OutstandingAmountInUSD =OutstandingAmountInUSD ; 
			 Если OutstandingAmountInUSD  <= 0 И Оплаты.Количество() Тогда
				 Overdue =  ОбщегоНазначенияБПКлиентСервер.РазностьДат(НачалоДня(Выборка.DueDateOverdue),НачалоДня(Оплаты[0].Дата),Перечисления.Периодичность.День);
				 СтрокаДанных.Overdue =  Overdue;
			 КонецЕсли;        
			   //Overdue Это разность дат между сроком оплаты документов и датой окончания расчетов, если окончание периода
            	         // если заполнена дата оплаты - тогда разность дат между датой оплаты и сроком оплаты - если документ оплачен 
			 Если  Overdue<=0 Тогда   СтрокаДанных.NotDue = OutstandingAmountInUSD;	
			 ИначеЕсли  Overdue>0 и Overdue<8 Тогда СтрокаДанных.СуммаПросрочкиДо7 = OutstandingAmountInUSD; 
			 ИначеЕсли  Overdue>=8 и Overdue<15 Тогда  СтрокаДанных.СуммаПросрочкиДо14 = OutstandingAmountInUSD;  
			 ИначеЕсли  Overdue>=15 и Overdue<22 Тогда  СтрокаДанных.СуммаПросрочкиДо21 = OutstandingAmountInUSD;  
			 ИначеЕсли  Overdue>=22 и Overdue<29 Тогда  СтрокаДанных.СуммаПросрочкиДо28 = OutstandingAmountInUSD;  
			 ИначеЕсли  Overdue>=29 и Overdue<46 Тогда  СтрокаДанных.СуммаПросрочкиДо45 = OutstandingAmountInUSD;  
			 ИначеЕсли  Overdue>=46 Тогда СтрокаДанных.СуммаПросрочкиБольше45 = OutstandingAmountInUSD;  
			 КонецЕсли; 
			 Если  Overdue>0  Тогда   СтрокаДанных.OverdueAmount = OutstandingAmountInUSD;	КонецЕсли;   
			 СтрокаДанных. AVG = Overdue;
		 КонецЕсли;   
		 
	 КонецЦикла; 
	 
	 Возврат ТаблицаДанных;    
	 
 КонецФункции // ПолучитьТаблицуДанных()
 
Функция ПолучитьТекстЗапроса()
  
  Текст = "ВЫБРАТЬ
          |	СчетНаОплатуПокупателю.Ссылка КАК Invoice,
          |	СчетНаОплатуПокупателю.Дата КАК InvoiceDate,
          |	СчетНаОплатуПокупателю.Номер КАК InvoiceNumber,
          |	СчетНаОплатуПокупателю.Контрагент КАК Counterparty,
          |	СчетНаОплатуПокупателю.Организация КАК Organization,
          |	СчетНаОплатуПокупателю.ПодразделениеОрганизации КАК Vessel,
          |	СчетНаОплатуПокупателю.Рейс КАК Voyage,
          |	ВЫРАЗИТЬ(СчетНаОплатуПокупателю.Комментарий КАК СТРОКА(1000)) КАК Comment,
          |	ЕСТЬNULL(СрокиОплатыДокументов.СрокОплаты, ДАТАВРЕМЯ(1, 1, 1)) КАК DueDate,
          |	ВЫБОР
          |		КОГДА СрокиОплатыДокументов.СрокОплаты = ДАТАВРЕМЯ(1, 1, 1)
          |			ТОГДА &ДатаОкончания
          |		ИНАЧЕ СрокиОплатыДокументов.СрокОплаты
          |	КОНЕЦ КАК DueDateOverdue,
          |	РАЗНОСТЬДАТ(ВЫБОР
          |			КОГДА СрокиОплатыДокументов.СрокОплаты = ДАТАВРЕМЯ(1, 1, 1)
          |				ТОГДА &ДатаОкончания
          |			ИНАЧЕ СрокиОплатыДокументов.СрокОплаты
          |		КОНЕЦ, &ДатаОкончания, ДЕНЬ) КАК Overdue,
          |	СчетНаОплатуПокупателю.СуммаДокумента КАК InvoiceAmount,
          |	СчетНаОплатуПокупателю.ВалютаДокумента КАК Currency,
          |	РАЗНОСТЬДАТ(СчетНаОплатуПокупателю.Дата, ЕСТЬNULL(СрокиОплатыДокументов.СрокОплаты, ДАТАВРЕМЯ(1, 1, 1)), ДЕНЬ) КАК TermsOfPayment_устарев,
          |	ВЫРАЗИТЬ(ЕСТЬNULL(СтатусыДокументов.Статус, &СтатусОплатыПоУмолчанию) КАК Перечисление.СтатусОплатыСчета) КАК Статус,
          |	СчетНаОплатуПокупателю.ТипСервиса КАК ServiceType,
          |	СчетНаОплатуПокупателю.Рейс.бит_ПортЗагрузки КАК LoadingPort,
          |	СчетНаОплатуПокупателю.Рейс.бит_ПортВыгрузки КАК UnloadingPort,
          |	СчетНаОплатуПокупателю.ДоговорКонтрагента.бит_УсловиеОплаты КАК TermsOfPayment,
          |	СчетНаОплатуПокупателю.ДатаОтправкиИнвойсаКлиенту КАК SendDate,
          |	СчетНаОплатуПокупателю.ОрганизацияПолучатель КАК Payee,
          |	ВЫБОР
          |		КОГДА СчетНаОплатуПокупателю.Дата < ДАТАВРЕМЯ(2025, 1, 1, 0, 0, 0)
          |			ТОГДА СчетНаОплатуПокупателю.Дата
          |		ИНАЧЕ СчетНаОплатуПокупателю.бит_ПериодУслуги
          |	КОНЕЦ КАК ServicePeriod,
          |	СчетНаОплатуПокупателю.ТипСервиса.Родитель КАК Service,
          |	СчетНаОплатуПокупателю.ДоговорКонтрагента.Номер КАК ContractNumber,
          |	ВЫРАЗИТЬ(СчетНаОплатуПокупателю.dn_ДополнительныйКомментарий КАК СТРОКА(1000)) КАК AdditionalComment,
          |	СчетНаОплатуПокупателю.dn_ДатаОплатыТретьейСтороне КАК PaymentDateToThirdParty
          |ИЗ
          |	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
          |		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиОплатыДокументов КАК СрокиОплатыДокументов
          |		ПО СчетНаОплатуПокупателю.Организация = СрокиОплатыДокументов.Организация
          |			И СчетНаОплатуПокупателю.Ссылка = СрокиОплатыДокументов.Документ}
          |		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
          |		ПО СчетНаОплатуПокупателю.Организация = СтатусыДокументов.Организация
          |			И СчетНаОплатуПокупателю.Ссылка = СтатусыДокументов.Документ}
          |ГДЕ
          |	СчетНаОплатуПокупателю.Проведен
          |	И СчетНаОплатуПокупателю.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
          |	И СчетНаОплатуПокупателю.dn_DoNotUseForExternalSaleRepots = ЛОЖЬ";

	Возврат Текст
  
КонецФункции // ПолучитьТекстЗапроса()    

Функция ПолучитьТаблицуОплат(СписокСчетов,ДатаНачала,ДатаОкончания)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетНаОплатуПокупателю.Ссылка КАК Счет,
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа КАК СуммаПлатежа,
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.Дата КАК Дата,
	               |	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.ВалютаДокумента КАК ВалютаОплаты
	               |ИЗ
	               |	Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	               |		ПО ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СчетНаОплату = СчетНаОплатуПокупателю.Ссылка
	               |ГДЕ
	               |	СчетНаОплатуПокупателю.Ссылка В(&СписокСчетов)
	               |	И ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	Запрос.УстановитьПараметр("СписокСчетов",СписокСчетов);
	Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",ТекущаяДатаСеанса());
	ТаблицаДанныхОплаты =Запрос.Выполнить().Выгрузить();	
	Возврат ТаблицаДанныхОплаты   
КонецФункции // ПолучитьТекстЗапроса()    

// Возвращает значение параметра компоновки данных
//
// Параметры:
//	ОбъектНастройки - НастройкиКомпоновкиДанных - объект настройки.
//					- ПользовательскиеНастройкиКомпоновкиДанных -
//					- КомпоновщикНастроекКомпоновкиДанных -
//					- НастройкиВложенногоОбъектаКомпоновкиДанных -
//					- ДанныеРасшифровкиКомпоновкиДанных -
//					- КоллекцияЗначенийПараметровКомпоновкиДанных -
//					- ОформлениеКомпоновкиДанных -
//	Параметр		- Строка, ПараметрКомпоновкиДанных - поле или имя поля, для которого нужно вернуть параметр.
//
// Возвращаемое значение:
//	ЗначениеПараметраНастроекКомпоновкиДанных - Неопределено, если параметр не найден.
//
Функция ПолучитьПараметр(ОбъектНастройки, Параметр) Экспорт
	
	ЗначениеПараметра = Неопределено;
	ПолеПараметр = ?(ТипЗнч(Параметр) = Тип("Строка"), Новый ПараметрКомпоновкиДанных(Параметр), Параметр);
	
	Если ТипЗнч(ОбъектНастройки) = Тип("НастройкиКомпоновкиДанных") Тогда
		ЗначениеПараметра = ОбъектНастройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
	ИначеЕсли ТипЗнч(ОбъектНастройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		Для Каждого ЭлементНастройки Из ОбъектНастройки.Элементы Цикл
			Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			   И ЭлементНастройки.Параметр = ПолеПараметр Тогда
				ЗначениеПараметра = ЭлементНастройки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ОбъектНастройки) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Для Каждого ЭлементНастройки Из ОбъектНастройки.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
				И ЭлементНастройки.Параметр = ПолеПараметр Тогда
				ЗначениеПараметра = ЭлементНастройки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеПараметра = Неопределено Тогда
			ЗначениеПараметра = ОбъектНастройки.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
		КонецЕсли;
		Если ЗначениеПараметра = Неопределено Тогда
			ЗначениеПараметра = ОбъектНастройки.ФиксированныеНастройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ОбъектНастройки) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
		ЗначениеПараметра = ОбъектНастройки.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
	ИначеЕсли ТипЗнч(ОбъектНастройки) = Тип("ДанныеРасшифровкиКомпоновкиДанных") Тогда
		ЗначениеПараметра = ОбъектНастройки.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
	ИначеЕсли ТипЗнч(ОбъектНастройки) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
		ЗначениеПараметра = ОбъектНастройки.Найти(ПолеПараметр);
	ИначеЕсли ТипЗнч(ОбъектНастройки) = Тип("ОформлениеКомпоновкиДанных") Тогда
		ЗначениеПараметра = ОбъектНастройки.НайтиЗначениеПараметра(ПолеПараметр);
	КонецЕсли;
	
	Возврат ЗначениеПараметра;
	
КонецФункции
